---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BeamSystemType
source: html/5ac8ee1c-41f0-0c4b-0a6b-0251b427c251.htm
---
# BeamSystemType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.